cases/05_navier_stokes_equation/19_lid_driven_cavity_piso_Re3200_hybrid80/N80/constant/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9282
(
0.0415106762428
0.0736589819912
0.0190539000271
0.0968337791182
0.042562003425
0.499928424581
0.382167747939
0.258210541367
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.0299999999999 0.0899999999999 0.183333333333 0.816666666666 0.31 0.436666666666 0.563333333333 0.689999999999 0.97 0.91);
    }
    leftWall
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           uniform 1;
    }
    movingTop
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.0299999999999 0.0899999999999 0.183333333333 0.816666666666 0.31 0.436666666666 0.563333333333 0.689999999999 0.97 0.91);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
