cases/05_navier_stokes_equation/19_lid_driven_cavity_piso_Re3200_hybrid80/N80/constant/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9282
(
0.019410578895
0.0742251165195
0.0415897801916
0.0428001190194
0.0970262805309
0.0697433896098
0.0643609274769
0.0631826271454
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.0299999999999 0.0899999999999 0.183333333333 0.816666666666 0.31 0.436666666666 0.563333333333 0.689999999999 0.97 0.91);
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.0299999999999 0.0899999999999 0.183333333333 0.816666666666 0.31 0.436666666666 0.563333333333 0.689999999999 0.97 0.91);
    }
    movingTop
    {
        type            calculated;
        value           nonuniform List<scalar> 10(1 1 1 1 1 1 1 1 1 1);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
